Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Using the default integer type in everyday situations means that integer constants and variables are immediately interoperable in your code and will match the inferred type for integer literal values.
ja: 日々の状況において初期状態として整数型を使うことは、整数の定数と変数があなたのコードにおいて直接に情報交換が可能で、いろいろな整数のリテラル値に対して推論される型と調和することを意味します。

source: Using the opaque type some Container as a return type expresses the desired API contract—the function returns a container, but declines to specify the container’s type:
ja: 不透明型some Containerを戻り型として使うことは、望まれるAPI契約を表現します — 関数はあるコンテナ（容れ物）を返します、しかしコンテナのもつ型を指定することを辞退します。

source: Using this attribute is equivalent to calling the NSApplicationMain(_:_:) function.
ja: この属性を使用することは、NSApplicationMain(_:_:)関数を呼ぶことに相当します。

source: Using this attribute is equivalent to calling the UIApplicationMain function and passing this class’s name as the name of the delegate class.
ja: この属性を使用することは、UIApplicationMain関数を呼んで、このクラスの名前を委任先クラスの名前として渡すことに相当します。

source: Valid arguments
ja: 有効な引数

source: Value
ja: 値

source: Value Bindings
ja: 値束縛

source: Value Overflow
ja: 値オーバフロー

source: Value types (structures and enumerations) do not support inheritance, and so their initializer delegation process is relatively simple, because they can only delegate to another initializer that they provide themselves.
ja: 値型（構造体と列挙）は、継承をサポートしません、なので、それらのイニシャライザ委任プロセスは比較的単純です、なぜなら、それらがそれら自身で提供する別のイニシャライザに委任できるだけだからです。

source: Value types are described in Structures and Enumerations Are Value Types.
ja: 値型は「構造体と列挙は値型です」で記述されます。

source: Value-Binding Pattern
ja: 値束縛パターン

source: Value-binding patterns that bind a matched value to the name of a constant begin with the let keyword; those that bind to the name of variable begin with the var keyword.
ja: マッチした値を定数の名前に束縛する値束縛パターンは、letキーワードで始まります；変数の名前と縛りつけるものは、varキーワードで始まります。

source: Values are captured in key paths using value semantics.
ja: 様々な値は、キーパスの中に値意味論を使ってキャプチャされます。

source: Values are never implicitly converted to another type.
ja: なんらかの値が暗黙のうちに別の型に変換されることは決してありません。

source: Values in switch cases can be checked for their inclusion in an interval.
ja: switchケース節における値は、ある区間におけるそれの包含について調べられることが出来ます。

source: Values in the matrix can be set by passing row and column values into the subscript, separated by a comma:
ja: 行列の中の値は、コンマで区切った行と列の値を添え字に渡すことによって設定されることができます：

source: Variable Declaration
ja: 変数の宣言

source: Variable declarations have several forms that declare different kinds of named, mutable values, including stored and computed variables and properties, stored variable and property observers, and static variable properties.
ja: 変数宣言はいくつかの形式を持ちます、それらは、格納および計算の変数およびプロパティ、格納である変数およびプロパティのオブザーバー、そして静的変数プロパティを含む、異なる種類の名前をつけられた可変の値を宣言します。

source: Variables and constants declared in the scope of a do statement can be accessed only within that scope.
ja: do文のスコープ内で宣言される変数と定数は、そのスコープ内でのみアクセスされることができます。

source: Variables are always initialized before use.
ja: 変数は、常に使用前に初期化される。

source: Variadic Parameters
ja: 可変長パラメータ

source: Variadic parameters are allowed, subject to the same rules as for normal methods.
ja: 可変長パラメータは、許され、普通のメソッドと同じ規則の支配下にあります。

source: Variadic parameters can be used if you name the variadic parameter.
ja: あなたが可変長パラメータに名前をつけるならば、可変長パラメータが使われることができます。

source: Version Compatibility
ja: バージョン互換性

source: We can’t wait to see what you create with it.
ja: 私達は、あなたがそれで何をつくるか知るのが待ち切れません。

source: Weak References
ja: 弱い参照

source: Weak and Unowned References
ja: 弱いおよび非所有参照

source: Weak and unowned references enable one instance in a reference cycle to refer to the other instance without keeping a strong hold on it.
ja: 弱いおよび非所有参照は、ある参照循環の中の１つのインスタンスに、他のインスタンスに言及することをそれに対する強い支配力を持つことなく可能にします。

source: Weak references are always of an optional type, and automatically become nil when the instance they reference is deallocated.
ja: 弱い参照は常にオプショナルの型です、そしてそれが参照をつけるインスタンスが割り当て解除されるとき、自動的にnilになります。

source: Welcome to Swift
ja: スウィフトにようこそ

source: What about the second and third blocks?
ja: ２番目と３番目のブロックはどうですか？

source: What changes do you need to make to SimpleClass and SimpleStructure so that they still conform to the protocol?
ja: どんな変更をあなたはSimpleClassとSimpleStructureにする必要があるでしょうか、それらが依然としてそのプロトコルに準拠するためには？

source: What error do you get?
ja: あなたは、どんなエラーを得ますか？

source: What greeting do you get?
ja: あなたは、どんな挨拶を得ますか？

source: What kind of error do you need to throw so that the error is handled by the first catch block?
ja: エラーが最初のcatchブロックによって取り扱われるためには、どんな種類のエラーをあなたはスローする必要があるでしょう。

source: When cinema was given the current value of hd, the values stored in hd were copied into the new cinema instance.
ja: cinemaがhdの現在の値を与えられたとき、hdに格納される値は新しいcinemaインスタンスにコピーされました。

source: When log() is called on the instance that’s passed to doSomething(_:), the customized title is omitted from the logged string.
ja: log()がdoSomething(_:)に渡されるインスタンス上で呼び出される時、カスタマイズされたタイトルはログ文字列から省かれます。

source: When printMathResult(_:_:_:) is called, it is passed the addTwoInts(_:_:) function, and the integer values 3 and 5.
ja: printMathResult(_:_:_:)が呼ばれるとき、それは、addTwoInts(_:_:)関数、そして整数値3と5を渡されます。

source: When rememberedDirection is assigned the value of currentDirection, it’s actually set to a copy of that value.
ja: rememberedDirectionがcurrentDirectionの値を代入されるとき、それは実際にはその値のコピーに設定されます。

source: When index is modified, the key-path expression still references the third element, while the closure uses the new index.
ja: indexが修正される時、キーパス式は依然として３番目の要素に参照を付けます、一方でクロージャは新しいインデックスを使用します。

source: When residence is nil, as in the example above, this optional Int will also be nil, to reflect the fact that it was not possible to access numberOfRooms.
ja: residenceがnilのとき、上の例の場合のように、このオプショナルのIntはまたnilになり、numberOfRoomsにアクセスすることは可能でなかったという事実を反映します。

source: When a break statement is followed by the name of a statement label, it ends program execution of the loop, if statement, or switch statement named by that label.
ja: break文に文ラベルの名前が続くとき、それはそのラベルによって指定されるループ、if文、またはswitch文のプログラム実行を終了します。

source: When a break statement is not followed by the name of a statement label, it ends program execution of the switch statement or the innermost enclosing loop statement in which it occurs.
ja: break文に文ラベルの名前が続かないとき、それはswitch文またはそれが現れているところの最も内側のそれを囲んでいるループ文のプログラム実行を終了します。

source: When a continue statement is followed by the name of a statement label, it ends program execution of the current iteration of the loop statement named by that label.
ja: continue文に文ラベルの名前が続くとき、それは、そのラベルによって指名されるループ文の現在の繰り返しのプログラム実行を終了します。

source: When a continue statement is not followed by the name of a statement label, it ends program execution of the current iteration of the innermost enclosing loop statement in which it occurs.
ja: continue文に文ラベルの名前が続かないとき、それは、それが現れるところの一番内側のそれを囲んでいるループ文の現在の繰り返しのプログラム実行を終了します。

source: When a return statement is followed by an expression, the value of the expression is returned to the calling function or method.
ja: return文の後に式が続くとき、式の値は関数またはメソッドを呼んでいるところに返されます。

source: When a return statement is not followed by an expression, it can be used only to return from a function or method that does not return a value (that is, when the return type of the function or method is Void or ()).
ja: return文の後に式が続かないとき、それは値を返さない関数またはメソッド（すなわち、戻り型がVoidまたは()である関数またはメソッド）から返るためにだけ使われることができます。

source: When a Unicode string is written to a text file or some other storage, the Unicode scalars in that string are encoded in one of several Unicode-defined encoding forms.
ja: あるUnicode文字列がテキスト・ファイルまたは何か他の記憶装置に書かれるとき、その文字列内のユニコード・スカラーはいくつかのUnicode定義の符号化方式のうちの１つで符号化されます。

source: When a channel’s audio level is 0, none of the lights for that channel are lit.
ja: チャンネルの音声のレベルが0であるとき、そのチャンネルのための光のどれも点灯されません。

source: When a class implements an initializer to satisfy a protocol’s initializer requirement, the initializer must be marked with the required declaration modifier if the class is not already marked with the final declaration modifier.
ja: あるクラスがプロトコルのイニシャライザ要件を満たすためにイニシャライザを実装するとき、そのイニシャライザはrequired宣言修飾子を使って印される必要が、そのクラスが既にfinal宣言修飾子を使って印されていないならば、あります。

source: When a closure is the only argument to a function, you can omit the parentheses entirely.
ja: ひとつのクロージャが関数の唯一の引数である時、あなたは丸括弧をすっかり省くことができます。

source: When a closure’s type is already known, such as the callback for a delegate, you can omit the type of its parameters, its return type, or both.
ja: クロージャの型がすでに知られているとき、例えば委任先のためのコールバックなどでは、あなたはそのパラメータの型、その戻り型、あるいは両方を省略することができます。

source: When a concrete type conditionally conforms to a protocol, that type implicitly conforms to any parent protocols with the same requirements.
ja: 具象型があるプロトコルに条件準拠するとき、その型は同じ要件を持つあらゆる親プロトコルに暗黙的に準拠します。

source: When a constant declaration occurs in the context of a class or structure declaration, it is considered a constant property.
ja: 定数宣言がクラスまたは構造体宣言の文脈において起こるとき、それは定数プロパティとみなされます。

source: When a constant declaration occurs in the context of a function or method, it can be initialized later, as long as it is guaranteed to have a value set before the first time its value is read.
ja: 定数宣言が関数またはメソッドの文脈において現れるとき、それは後で初期化されることができます、それがある値をその値が読み出される最初の時の前に設定されてしまっているよう保証する限りは。

source: When a constant is declared at global scope, it must be initialized with a value.
ja: 定数がグローバルなスコープで宣言されるとき、それはひとつの値で初期化されなければなりません。

source: When a declaration is obsoleted, it’s removed from the specified platform or language and can no longer be used.
ja: ある宣言が廃止された場合は、それは指定されたプラットホームまたは言語から取り除かれます、そしてもはや使用されることはできません。

source: When a function encounters an error condition, it throws an error.
ja: ある関数がエラー状態に遭遇するとき、それはあるエラーをスローします（投げます）。

source: When a function throws an error, it changes the flow of your program, so it’s important that you can quickly identify places in your code that can throw errors.
ja: ある関数がエラーをスローするとき、それはあなたのプログラムの流れを変えます、そのため重要なのは、あなたがすばやくあなたのコードの中のエラーをスローできる場所を識別することです。

source: When a library’s authors mark an enumeration as nonfrozen, they reserve the right to add new enumeration cases, and any code that interacts with that enumeration must be able to handle those future cases without being recompiled.
ja: あるライブラリの作者たちがある列挙を非凍結として印する時、彼らは新しい列挙ケース節を加える権利を有します、そしてその列挙と相互作用する何らかのコードは、それらの未来ケース節を再コンパイルされることなしに取り扱いできる必要があります。

source: When a member has the same name as a keyword, references to that member don’t need to be escaped with backticks, except when there’s ambiguity between referring to the member and using the keyword—for example, self, Type, and Protocol have special meaning in an explicit member expression, so they must be escaped with backticks in that context.
ja: あるメンバがあるキーワードと同じ名前を持つ時、そのメンバへの参照はバッククォートでエスケープされる必要はありません、そのメンバへの参照とキーワードの使用の間に曖昧さがある場合を除いては—例えば、self、Type、そしてProtocolは、特別な意味をある明示的なメンバ式の中で持ちます、それでそれらはバッククォートでエスケープされることがその文脈においては必要です。

source: When a protocol composition type contains type aliases, it’s possible for the same protocol to appear more than once in the definitions—duplicates are ignored.
ja: あるプロトコル合成型が型エイリアスを含む場合、同じプロトコルが複数回定義の中に現れることが可能です — 重複は無視されます。

source: When a protocol type inherits from other protocols, the set of requirements from those other protocols are aggregated together, and any type that inherits from the current protocol must conform to all of those requirements.
ja: プロトコル型が他のプロトコルから継承するとき、それらの他のプロトコルからの要件ひとそろいは一緒にまとめられます、そして、現在のプロトコルから継承するどんな型でもそれらの要件の全てに準拠しなければなりません。

source: When a protocol type inherits from other protocols, the set of requirements from those other protocols are aggregated, and any type that inherits from the current protocol must conform to all those requirements.
ja: あるプロトコル型が他のプロトコルから継承するとき、それらの他のプロトコルからの要件一式は、ひとまとめにされます、そして現在のプロトコルから継承するどんな型でも、それらの要件の全てに従わなければなりません。

source: When a single else clause is present, an if statement has the following form:
ja: ただ１つだけのelse節が含まれている時は、if文は以下の形式を持ちます：

source: When a tuple pattern is used as the pattern in a for-in statement or in a variable or constant declaration, it can contain only wildcard patterns, identifier patterns, optional patterns, or other tuple patterns that contain those.
ja: タプルパターンがfor-in文においてまたは変数や定数宣言においてパターンとして使われるとき、それはワイルドカード・パターン、識別子パターン、オプショナルパターン、またはそれらを含む他のタプルパターンだけを含むことができます。

source: When a type alias is declared with generic parameters, the constraints on those parameters must match exactly the constraints on the existing type’s generic parameters.
ja: ある型エイリアスが総称体パラメータで宣言されるとき、それらのパラメータ上の制約は厳密に既存の型の持つ総称体パラメータ上の制約に一致しなければなりません。

source: When a variable declaration of this form is declared at global scope or the local scope of a function, it is referred to as a computed variable.
ja: この形式の変数の宣言がグローバルなスコープまたは関数のローカルなスコープで宣言されるとき、それは計算変数と呼ばれます。

source: When a variable declaration of this form is declared at global scope or the local scope of a function, it is referred to as a stored variable.
ja: この形式の変数の宣言がグローバルなスコープまたは関数のローカルなスコープで宣言されるとき、それは格納変数と呼ばれます。

source: When a variable declaration of this form is declared at global scope or the local scope of a function, the observers are referred to as stored variable observers.
ja: この形式の変数の宣言がグローバルなスコープまたは関数のローカルスコープで宣言されるとき、オブザーバーは格納変数オブザーバーと呼ばれます。

source: When accessing the elements in a multidimensional array, the left-most subscript index refers to the element at that index in the outermost array.
ja: 多次元配列の要素にアクセスするとき、最も左の添え字インデックスは、最も外側の配列の中のそのインデックスでの要素に言及します。

source: When alternative productions are too long to read easily, they are broken into multiple grammar production rules on new lines.
ja: 代替の導出が簡単に読むにはあまりに長いとき、それらが新しい行で複数部分の文法導出規則へとばらされます。

source: When an element of a tuple type has a name, that name is part of the type.
ja: あるタプル型の要素が名前を持つ場合、その名前は型の一部です。

source: When an error is thrown, some surrounding piece of code must be responsible for handling the error—for example, by correcting the problem, trying an alternative approach, or informing the user of the failure.
ja: あるエラーがスローされるとき、なかには周囲のコード部分がエラーを処理することに対して責任を持たなければならないこともあります ― 例えば、問題を訂正すること、代わりの取り組みを試みること、または失敗をユーザに知らせることによって。

source: When an instance of a value type is marked as a constant, so are all of its properties.
ja: 値型のインスタンスが定数として印される時は、そのプロパティの全てがそうです。

source: When considered in isolation, the nested incrementer() function might seem unusual:
ja: 切り離して考えたとき、入れ子にされたincrementer()関数は普通でないものに見えるかもしれません：

source: When creating a selector for a property’s getter, the property name can be a reference to a variable or constant property.
ja: プロパティのゲッターのためのセレクタを作成するとき、property nameは変数または定数プロパティへの参照であることができます。

source: When defining a class, the name of the superclass must appear first in the list of type identifiers, followed by any number of protocols the class must conform to.
ja: クラスを定義するとき、スーパークラスの名前は型識別子のリストにおいて最初に現れなければなりません、そしてそのクラスが準拠しなければならないいくらかのプロトコルが続きます。

source: When defining a protocol, it’s sometimes useful to declare one or more associated types as part of the protocol’s definition.
ja: プロトコルを定義するとき、時々役に立つのは、プロトコルの定義の一部として１つ以上の関連型を宣言することです。

source: When it is declared in the context of a class or structure declaration, it is referred to as a stored variable property.
ja: それがクラスまたは構造体宣言の文脈において宣言されるとき、それは格納変数プロパティと呼ばれます。

source: When it is declared in the context of a class or structure declaration, the observers are referred to as property observers.
ja: それがクラスまたは構造体宣言の文脈において宣言されるとき、オブザーバーはプロパティオブザーバーと呼ばれます。

source: When it is declared in the context of a class, structure, or extension declaration, it is referred to as a computed property.
ja: それがクラス、構造体、または拡張宣言の文脈において宣言されるとき、それは計算プロパティと呼ばれます。

source: When it isn’t appropriate to provide a case for every enumeration case, you can provide a default case to cover any cases that aren’t addressed explicitly:
ja: すべての列挙ケース節にcaseを提供することが妥当でないとき、あなたは明確に指定されないあらゆる場合を扱うためにdefaultケース節を提供することができます：

source: When one class inherits from another, the inheriting class is known as a subclass, and the class it inherits from is known as its superclass.
ja: あるクラスが他のものから継承するとき、継承を受けているクラスはサブクラスとして知られています、そして、そこからそれが譲り受ける原点のクラスは、それのスーパークラスとして知られています。

source: When set to true, an operator in the corresponding precedence group uses the same grouping rules during optional chaining as the assignment operators from the standard library.
ja: trueに設定する場合、対応する優先順位グループの演算子は標準ライブラリ由来のassignment（割り当て）演算子と同じグループ化規則をオプショナル連鎖の間に使います。

source: When specifying the type annotation for a literal value, the annotation’s type must be a type that can be instantiated from that literal value.
ja: あるリテラル値に型注釈を指定するとき、その注釈の型は、そのリテラル値からインスタンス化されることができる型でなければなりません。

source: When strings are used for raw values, the implicit value for each case is the text of that case’s name.
ja: 文字列が生の値のために使われる時、各ケース節のための暗黙的な値は、そのケース節の名前のテキストです。

source: When switching over a nonfrozen enumeration value, you always need to include a default case, even if every case of the enumeration already has a corresponding switch case.
ja: 非凍結列挙値に対してスイッチしている時、あなたは常にdefaultケース節を含む必要があります、たとえ列挙のあらゆるケース節が既に対応するスイッチケース節を持つとしてもです。

source: When that case is matched by the switch statement, the break statement inside the case ends the switch statement’s execution immediately.
ja: そのケース節がswitch文によってマッチされるとき、ケース節の内側のbreak文は直ちにswitch文の実行を終えます。

source: When the log() method is called on oneAndTwo directly, the specialized version containing the title string is used.
ja: log()メソッドがoneAndTwoにおいて直接に呼び出される時、タイトル文字列を含んでいる特殊化版が使われます。

source: When the audio level is 10, all of the lights for that channel are lit.
ja: 音声のレベルが10であるとき、そのチャンネルのための光の全ては点灯されます。

source: When the compiler isn’t in library evolution mode, all structures and enumerations are implicitly frozen, and this attribute is ignored.
ja: コンパイラがライブラリ進化モードではない場合、全ての構造体と列挙は暗黙的に凍結されます、そしてこの属性は無視されます。

source: When the enumeration type can be inferred from context, you can omit it (the dot is still required), as described in Enumeration Syntax and Implicit Member Expression.
ja: 列挙型が前後関係から推論されることができるとき、列挙構文と暗黙のメンバー式で記述されるように、あなたはそれを省略することができます（ドットは依然必要です）。

source: When the expression on the left-hand side of a binary operator is marked with try, try?, or try!, that operator applies to the whole binary expression.
ja: ある二項演算子の左手側での式がtry、try?、またはtry!で印される場合、その演算子は二項式全体に適用されます。

source: When the function is called, the value of the argument is copied.
ja: 関数が呼ばれる時、その引数の値はコピー（複製）をつくられます。

source: When the function returns, the copy’s value is assigned to the original argument.
ja: 関数が戻る時、コピーの値はそのオリジナルの（元の）引数に代入されます。

source: When the match succeeds, the value 42 is bound (assigned) to the constant name someValue.
ja: マッチが成功するとき、値42は、定数の名前のsomeValueに縛りつけられます（代入されます）。

source: When the pattern on the left-hand side of a variable or constant declaration is an identifier pattern, the identifier pattern is implicitly a subpattern of a value-binding pattern.
ja: 変数や定数宣言の左側のパターンが識別子パターンであるとき、その識別子パターンは暗黙のうちに値束縛パターンの下位パターンです。

source: When the second function is called, the message is still printed by the first function, but the returned value is not used.
ja: 第二の関数が呼ばれるとき、メッセージは最初の関数によって依然として出力されます、しかし返された値は使われません。

source: When this detailed form is used, only the imported symbol (and not the module that declares it) is made available in the current scope.
ja: この詳細な書式が使われるとき、インポートされたシンボルだけが（そしてそれを宣言するモジュールでなく）、現在のスコープにおいて利用可能にされます。

source: When this simply isn’t feasible (for example, when the control expression’s type is Int), you can include a default case to satisfy the requirement.
ja: これが単に実行可能でないとき（たとえば、制御式のもつ型がIntであるとき）、あなたはこの必要条件を満たすために省略時のケース節を含めることができます。

source: When two operators compete with each other for their operands, such as in the expression 2 + 3 * 5, the operator with the higher relative precedence binds more tightly to its operands.
ja: ２つの演算子がそれらの演算数に対して互いと比較される時、例えば式2 + 3 * 5などで、より高い関係優先順位を持つ演算子はよりきつくそれの演算数に束縛されます。

source: When used as the default value of a function or method parameter, the special literal’s value is determined when the default value expression is evaluated at the call site.
ja: 関数およびメソッドのパラメータの省略時の値として使われる時、特殊リテラルの値は、省略時値式が呼び出し現場で評価される場合は決定されます。

source: When used inside a switch statement, break causes the switch statement to end its execution immediately and to transfer control to the code after the switch statement’s closing brace (}).
ja: switch文の中に使われるとき、breakによってswitch文が直ちにその実行を終えて、switch文の閉じ波括弧（}）の後のコードへ制御を移します。

source: When used inside a loop statement, break ends the loop’s execution immediately and transfers control to the code after the loop’s closing brace (}).
ja: ループ文の内側で使われるとき、breakは直ちにループの実行を終えて、ループの閉じ波括弧（}）の後のコードへ制御を移します。

source: When working with optional values, you can write ? before operations like methods, properties, and subscripting.
ja: オプショナルの値を扱うとき、あなたはメソッド、プロパティ、そして添え字指定のような演算の前に?を書くことができます。

source: When you access a projected value from code that’s part of the type, like a property getter or an instance method, you can omit self. before the property name, just like accessing other properties.
ja: あなたがある予測値に、プロパティゲッターやインスタンスメソッドのようなその型の一部であるコードからアクセスする場合、あなたはself.をプロパティ名の前で省略できます、ちょうど他のプロパティにアクセスするように。

source: When you access a subscript on an optional value through optional chaining, you place the question mark before the subscript’s brackets, not after.
ja: あなたがオプショナル連鎖を通してオプショナルの値の上で添え字にアクセスするとき、あなたは添え字の角括弧の前に疑問符を置きます、後ろではなく。

source: When you apply a wrapper to a property and you don’t specify an initial value, Swift uses the init() initializer to set up the wrapper.
ja: あなたがラッパーをプロパティに適用するそしてあなたが初期値を指定しないならば、スウィフトはinit()イニシャライザを使ってラッパーを準備します。

source: When you apply a wrapper to a property, the compiler synthesizes code that provides storage for the wrapper and code that provides access to the property through the wrapper.
ja: あなたがあるラッパーをプロパティに適用する場合、コンパイラは、そのラッパーに対するストレージを提供するコードそしてそのラッパーに通してプロパティへのアクセスを提供するコードを合成します。

source: When you apply this attribute to a type, you create a custom attribute with the same name as the type.
ja: あなたがこの属性をある型に適用する場合、あなたはあるあつらえの属性をその型と同じ名前で作成します。

source: When you assign a closure to a property, you are assigning a reference to that closure.
ja: あなたがクロージャをプロパティに代入するとき、あなたは参照をそのクロージャに代入しています。

source: When you assign a default value to a stored property, or set its initial value within an initializer, the value of that property is set directly, without calling any property observers.
ja: あなたがある格納プロパティに省略時の値を代入する、またはその初期値をイニシャライザの内部で設定するとき、そのプロパティの値は、どんなプロパティオブザーバーも呼び出すことなく、直接に設定されます。

source: When you call a function that can throw an error, you prepend the try keyword to the expression.
ja: あなたがエラーをスローできる関数を呼ぶとき、あなたはtryキーワードをその式の前に追加します。

source: When you call a memberwise initializer, you can omit values for any properties that have default values.
ja: あなたがメンバー関連イニシャライザを呼び出す場合、あなたは省略時の値を持つあらゆるプロパティに対して値を省略できます。

source: When you call an overloaded generic function or initializer, the compiler uses these constraints to resolve which overloaded function or initializer to invoke.
ja: あなたがオーバーロードされた総称体関数またはイニシャライザを呼ぶとき、コンパイラはこれらの制約を使って、呼び出すことになるオーバーロードされた関数またはイニシャライザはどれか決定します。

source: When you declare a call-as-function method, you specify the number of arguments, and each argument’s type and label.
ja: あなたがcall-as-functionメソッドを宣言する場合、あなたは引数の数、そして各引数のもつ型およびラベルを指定します。

source: When you declare a function that takes a closure as one of its parameters, you can write @escaping before the parameter’s type to indicate that the closure is allowed to escape.
ja: あなたがある関数、それのパラメータの１つとしてクロージャをとるものを宣言する時、あなたは@escapingをパラメータの型の前に書くことによって、そのクロージャが脱出を許可されるのを指し示すことができます。

source: When you declare a generic type, function, subscript, or initializer, you specify the type parameters that the generic type, function, or initializer can work with.
ja: あなたがある総称体型、添え字、関数、またはイニシャライザを宣言するとき、あなたはその総称体型、関数、またはイニシャライザが扱うことができる型パラメータを指定します。
